{"pages":[{"url":"/pages/about.html.html","text":"Advanced software plays a fundamental role in large scientific projects. The primary goal of DIANA/HEP is to develop state-of-the-art tools for experiments which acquire, reduce, and analyze petabytes of data. Improving performance, interoperability, and collaborative tools through modifications and additions to ROOT and other packages broadly used by the community will allow users to more fully exploit the data being acquired at CERN's Large Hadron Collider (LHC) and other facilities. As part of the NSF's Software Infrastructure for Sustained Innovation (SI2) program, DIANA is concerned with the overarching goal of transforming innovations in research and education into sustained software resources that are an integral part of the cyberinfrastructure. Project Team Peter Elmer (Lead PI) - Princeton University, Department of Physics Brian P. Bockelman (PI) - University of Nebraska-Lincoln, Department of Computer Science and Engineering Kyle Cranmer (PI) - New York University, Department of Physics & Center for Data Science Michael D. Sokoloff (PI) - University of Cincinnati, Department of Physics Jinyang Li (Senior Personnel) - New York University, Computer Science Department David Lange - Princeton University, Department of Physics Gilles Louppe - New York University, Department of Physics & Center for Data Science James Pivarski - Princeton University, Department of Physics Eduardo Rodrigues - University of Cincinnati, Department of Physics Zhe Zhang - University of Nebraska-Lincoln, Department of Computer Science and Engineering (Ph.D. Student) Chien-Chin Huang - New York University, Computer Science Department (Ph.D. Student) Advisory Board Amber Boehnlein - CIO, Thomas Jefferson National Accelerator Facility Katherine Copic - Director of Growth, Insight Data Science Jacob VanderPlas - Director of Research, Physical Sciences, eScience Institute, University of Washington Fernando Pérez - Staff Scientist, Data Science and Technology Division, Lawrence Berkeley National Laboratory; Associate Researcher, Berkeley Institute for Data Science, UC Berkeley. Attanagoda Santha - Architect, Fannie Mae Acknowledgement This project is supported by National Science Foundation grants ACI-1450310, ACI-1450319, ACI-1450323, and ACI-1450377. Any opinions, findings, conclusions or recommendations expressed in this material are those of the developers and do not necessarily reflect the views of the National Science Foundation.","tags":"pages","title":"DIANA Overview"},{"url":"/pages/documents.html.html","text":"Documents Coming soon...","tags":"pages","title":"Documents"},{"url":"/pages/.html","text":"","tags":"pages","title":""},{"url":"/pages/jobs.html.html","text":"Cincinnati Position already filled. Nebraska The University of Nebraska-Lincoln is currently searching for a new Software Engineer hire to work on the DIANA project. Within the DIANA project, Nebraska is focusing on improving the performance and interoperability of ROOT I/O. Interested applicants should apply to http://employment.unl.edu/ under requisition S_150926. A summary from the posting's job description (https://employment.unl.edu/postings/47681): The Holland Computing Center (HCC) is a large High Performance Computing facility supporting the NU system. Position will work with other HCC personnel on the DIANA/HEP project which focuses on improving performance, increasing interoperability between HEP software analysis tools and other data-intensive scientific computing ecosystems (such as Apache Spark). Responsibilities include design and implementation of application interfaces; interacting with, using and managing large datasets and solving data-centric problems; organizing, visualizing and communicating digital data effectively. Position serves in both technical and management roles, working closely with technical specialists (e.g. application developers) and with user support (e.g. researchers). Position develops state-of-the-art data analysis tools for experiments which acquire, reduce, and analyze petabytes of data. Criminal background check will be conducted. Excellent benefits including staff/dependent scholarship program. Applicant review begins Feb 8. View requisition S_150926 at https://employment.unl.edu for details and to apply. UNL does not discriminate based upon any protected status. Please see http://www.unl.edu/equity/notice-nondiscrimination. While application reviews begins Feb 8, new applications can be accepted until the position is filled. NYU Position already filled. Princeton Positions already filled.","tags":"pages","title":"Job Opportunities"},{"url":"/Announcing_Diana.html","text":"We are proud to announce that DIANA/HEP has been funded by the National Science Foundation's Software Infrastructure for Sustained Innovation (SI2) program. We are just kicking off the project, and will be updating these web pages and adding posts as we go along. We have created DIANA-HEP GitHub Organization This is a little badge to make sure the web site is healthy:","tags":"Blog","title":"Announcing DIANA"}]}