{"pages":[{"url":"pages/about.html.html","text":"Project Team Peter Elmer (Lead PI) - Princeton University, Department of Physics Michael D. Sokoloff (PI) - University of Cincinnati, Department of Physics Mark Neubauer (PI) - University of Illinois at Urbana-Champaign, Department of Physics Nan Niu (Senior Personnel) - University of Cincinnati, Department of EECS Collaborators Dan Katz - National Center for Supercomputing Applications (NCSA), University of Illinois Urbana-Champaign Doug Thain - Computer Science and Engineering, University of Notre Dame The HEP Software Foundation Startup Team Acknowledgement This project is supported by National Science Foundation grants ACI-1558216, ACI-1558219, and ACI-1558233. Any opinions, findings, conclusions or recommendations expressed in this material are those of the developers and do not necessarily reflect the views of the National Science Foundation.","tags":"pages","title":"S2I2-HEP Overview"},{"url":"pages/documents.html.html","text":"SI2 and S2I2-HEP Conceptualization Documents Workshop Summary Report from the S2I2 HEP/CS workshop held at UIUC (7-9 Dec 2016) NSF Proposal - Conceptualization of an S2I2 Institute for High Energy Physics SI2-S2I2 Solicitation - NSF 15-553 S2I2 as part of NSF's SI2 program Conceptualization of an S2I2 Institute for High Energy Physics (S2I2-HEP) , poster for 2017 NSF SI2 PI Workshop Previous Community Documents DOE ASCR/HEP Exascale Requirements Review High Energy Physics Forum for Computational Excellence: Working Group Reports (I. Applications Software II. Software Libraries and Tools III. Systems) Particle Physics Project Prioritization Panel (P5) report: Building for Discovery: Strategic Plan for U.S. Particle Physics in the Global Context Snowmass: Planning the Future of U.S. Particle Physics (Snowmass 2013): Chapter 9: Computing Snowmass Computing Frontier: Software Development, Staffing and Training","tags":"pages","title":"Documents"},{"url":"pages/.html","text":"Advanced software plays a fundamental role for large scientific projects - from designing experimental instruments to acquiring, reducing, and analyzing the resulting data. The primary goal of the S2I2-HEP conceptualization project is to prepare a strategic plan for a potential NSF Scientific Software Innovation Institute (S2I2) to develop software for experiments taking data in the \"High-Luminosity Large Hadron Collider\" (HL-LHC) era in the 2020s. In addition, we are working with the HEP Software Foundation to prepare a larger HEP Community White Paper (CWP) describing a global roadmap for HEP Software and Computing R&D for the 2020s. To this end we are organizing a number of workshops between Fall 2016 and Summer 2017. Please join the Google Group for updates. Upcoming Events: 28-30 Mar, 2017 - CWP Visualization Workshop CERN (and Vidyo) Indico page 1-3 May, 2017 - 2nd S2I2 HEP/CS Workshop Princeton University Indico page 22-24 May, 2017 - HEP Analysis Ecosystem Retreat Amsterdam Indico page Workshop proposal 5-6 Jun, 2017 - CWP Event Processing Frameworks Workshop FNAL The workshop is just prior to the FNAL 50th Anniversary and User Meeting 26-30 Jun, 2017 - HEP Software Foundation Workshop LAPP (Annecy) Indico page Past Events: 23 Mar, 2017 - Community White Paper Follow-up at FNAL FNAL Indico page 20-22 Mar, 2017 - IML Topical Machine Learning Workshop CERN The workshop includes a CWP session on Machine Learning Indico page 9 Mar, 2017 - Software Triggers and Event Reconstruction WG meeting A CWP session at the Connecting The Dots workshop Indico page 8 Mar, 2017 - S2I2-HEP/OSG/USCMS/USAtlas Panel at OSG All Hands Meeting Indico page 23-26 Jan, 2017 - HEP Software Foundation Workshop University of California at San Diego / San Diego Supercomputer Center Indico page 7-9 Dec, 2016 - S2I2 HEP/CS Workshop University of Illinois at Urbana-Champaign Event page , Indico page Workshop summary report (pdf) The S2I2-HEP conceptualization project is part of the NSF's Software Infrastructure for Sustained Innovation (SI2) program.","tags":"pages","title":""},{"url":"pages/jobs.html.html","text":"Cincinnati Position already filled. Nebraska The University of Nebraska-Lincoln is currently searching for a new Software Engineer hire to work on the DIANA project. Within the DIANA project, Nebraska is focusing on improving the performance and interoperability of ROOT I/O. Interested applicants should apply to http://employment.unl.edu/ under requisition S_150926. A summary from the posting's job description (https://employment.unl.edu/postings/47681): The Holland Computing Center (HCC) is a large High Performance Computing facility supporting the NU system. Position will work with other HCC personnel on the DIANA/HEP project which focuses on improving performance, increasing interoperability between HEP software analysis tools and other data-intensive scientific computing ecosystems (such as Apache Spark). Responsibilities include design and implementation of application interfaces; interacting with, using and managing large datasets and solving data-centric problems; organizing, visualizing and communicating digital data effectively. Position serves in both technical and management roles, working closely with technical specialists (e.g. application developers) and with user support (e.g. researchers). Position develops state-of-the-art data analysis tools for experiments which acquire, reduce, and analyze petabytes of data. Criminal background check will be conducted. Excellent benefits including staff/dependent scholarship program. Applicant review begins Feb 8. View requisition S_150926 at https://employment.unl.edu for details and to apply. UNL does not discriminate based upon any protected status. Please see http://www.unl.edu/equity/notice-nondiscrimination. While application reviews begins Feb 8, new applications can be accepted until the position is filled. NYU Position already filled. Princeton Positions already filled.","tags":"pages","title":"Job Opportunities"},{"url":"NCSA_UIUC_WKSHP_RPT.html","text":"We would like to thank those of you who participated in the kick-off meeting for the S2I2-HEP HEP/CS conceptualization workshop last month: 7-9 Dec, 2016 - S2I2 HEP/CS Workshop University of Illinois at Urbana-Champaign Event page , Indico page The summary report from the workshop is now available at: http://s2i2-hep.org/downloads/s2i2-hep-cs-workshop-summary.pdf You can also find photos from the workshop and attendee profiles on the workshop event page: http://hep.physics.illinois.edu/hepg/S2I2-HEP-CS-WKSHP/home.html","tags":"Blog","title":"S2I2-HEP / CS Workshop Summary Report Available"},{"url":"HSF_SDSC_CWP_WKSHP.html","text":"We invite you to participate in the upcoming HEP Software Foundation (HSF) workshop on the Community White Paper (CWP) . The workshop will take place at the San Diego Supercomputer Center (SDSC) on 23-26 January, 2017. Information about the workshop, as well as a link to register can be found on the workshop website: https://indico.cern.ch/event/570249/overview This workshop is the first general workshop in the CWP community process , which is expected to last through summer, 2017. The S2I2-HEP project collaborates with the HSF to organize and implement the CWP community process.","tags":"Blog","title":"HEP Software Foundation Workshop at the San Diego Supercomputer Center"},{"url":"CWP-KICKOFF.html","text":"The process to prepare a Community White Paper (CWP): A Roadmap for HEP Software and Computing R&D for the 2020s has now begun. More information can be found on the HEP Software Foundation (HSF) CWP page . The S2I2-HEP Conceptualization project is an integral part of this larger community planning exercise. The first HSF workshop on the CWP is being planned for 23-27 Jan 2017 at the University of California at San Diego (UCSD). More information on this workshop will be forthcoming.","tags":"Blog","title":"HSF Community White Paper process begins at CHEP"},{"url":"NCSA_UIUC_WKSHP.html","text":"We invite you to participate in a workshop that is part of the conceptualization of an NSF Scientific Software Innovation Institute (S2I2) for High Energy Physi cs (HEP). The workshop will take place on 7-9 December, 2016, on the campus of t he University of Illinois at Urbana-Champaign and is being hosted by the Univers ity of Illinois HEP Group and the National Center for Supercomputing Application s (NSCA). The workshop page can be found at http://hep.physics.illinois.edu/hepg/S2I2-HEP-CS-WKSHP/home.html The worldwide particle physics community is currently planning upgrades to the Large Hadron Collider (LHC) at CERN in Geneva. The LHC today already uses a worldwide distributed computing grid to meet the needs of thousands of scientists to process and analyze some of the world's largest scientific datasets. The upgrades being planned will increase data volumes by more than two orders of magnitude and require significantly more complex data and analysis techniques. Funded via National Science Foundation S2I2 HEP conceptualization grants (ACI-1558216, ACI-1558219, and ACI-1558233), this kick-off workshop aims to bring together a diverse set of attendees from the particle physics and computer science (CS) communities to understand how the two communities could work together in the context of a future NSF Software Institute aimed at supporting particle physics research over the long term. While CS experience and expertise has been brought into the HEP community over the years, this is a chance to take a fresh look at planned HEP and computer science research and brainstorm about engaging specific areas of effort, perspectives, synergies and expertise of mutual benefit to HEP and CS communities, especially as it relates to a future NSF Software Institute for HEP. The workshop will be organized around a series of panels and breakout sessions tasked with identifying technical and organizational challenges, and proposing ways in which a Software Institute could be structured to address them. All participants are asked to contribute actively in these sessions, whether as part of a panel or a member of the audience. A poster session and reception is planned to allow for more fluid conversations. It is intended for limited travel support to be available to defray part of the cost of attendance. In the near future, additional information will be provided via the workshop web page and the S2I2-HEP Google Group . If you are receiving this email but are not yet a member, please consider joining. You can also find out more information about the S2I2-HEP Conceptualization Project at http://s2i2-hep.org/","tags":"Blog","title":"S2I2-HEP / CS Workshop at the University of Illinois at Urbana-Champaign"},{"url":"S2I2_Implementations.html","text":"The National Science Foundation has announced the first two S2I2 Software Institutes: the Science Gateways Community Institute and the Molecular Sciences Software Institute , representing a total investment of $35M by the NSF. These S2I2 awards are the first large-scale institutes funded by the Software Infrastructure for Sustained Innovation (SI2) program. The NSF has also awarded $500k to Princeton University , the University of Cincinnati , and the University of Illinois at Urbana-Champaign to fund the conceptualization of a software institute to accelerate research enabled by the High-Luminosity Upgrade at the Large Hadron Collider (HL-LHC. The S2I2-HEP conceptualization project will be an important step towards realizing the scientific potential of the HL-LHC. This project is aligned with the National Strategic Computing Initiative (NSCI) .","tags":"Blog","title":"Two NSF (S2I2) Software Institutes Funded"},{"url":"WLCG_MB_CWP.html","text":"Today the Management Board of the Worldwide LHC Computing Grid (WLCG) approved a charge for the HEP Software Foundation (HSF) and the LHC experiments ( Alice , Atlas , CMS , LHCb ) to proceed with preparing a Community White Paper (CWP) with a roadmap for Software and Computing Research and Development to prepare for the High Luminosity Large Hadron Collider (HL-LHC) in the 2020s. The S2I2-HEP Conceptualization project will be an integral part of this larger community planning exercise. The HL-LHC project anticipates significant upgrades to both the accelerator and large detectors which will extend the LHC physics programme through the 2030s. Realizing the full physics potential of these investments requires commensurate attention also to software, which is ubiquitous in the process by which data is acquired, managed, processed and analyzed to produce physics results from the LHC experiments.","tags":"Blog","title":"WLCG MB charges HSF and the LHC experiments to prepare a roadmap for a software upgrade"},{"url":"Announcing_S2I2.html","text":"We are happy to announce that the S2I2/HEP conceputalization project has been funded by the National Science Foundation's Software Infrastructure for Sustained Innovation (SI2) program. We are just kicking off the project, and will be updating these web pages and adding posts as we go along. General news will be posted to this website's blog, but we've also created a S2I2-HEP Google Group . If you are interested in following the S2I2-HEP conceptualization process, please subscribe to that mailing list.","tags":"Blog","title":"Announcing the S2I2-HEP conceptualization project"}]}